
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 7 to change, 3 to destroy.</code></pre>

* Create
  * module.feepay-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.feepay-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.ccpay-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.ccpay-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.feesregister-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.feesregister-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
* Delete
  * module.feepay-fail-action-group.azurerm_template_deployment.action-group
  * module.feepay-fail-alert.azurerm_template_deployment.custom_alert[0]
* Replace
  * azurerm_key_vault_secret.servicebus_primary_connection_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.ccpay_key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "ccpay_key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "ccpay-aat"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "ccpay-aat"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_key_vault_secret.email-alert-recipient will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "email-alert-recipient" {
      + content_type            = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "email-alert-recipient"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Insights/components/ccpay-aat"
        name                                  = "ccpay-aat"
      ~ tags                                  = {
          ~ "Team Contact"           = "#cc-payments-tech " -> "#fee-pay-nightly-pipeline"
            # (9 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
      - content_type            = "" -> null
      ~ id                      = "https://ccpay-aat.vault.azure.net/secrets/sb-primary-connection-string/114962ec6ca146f08cd8a3cde9b591d2" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat" -> (known after apply) # forces replacement
        name                    = "sb-primary-connection-string"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat/secrets/sb-primary-connection-string/versions/114962ec6ca146f08cd8a3cde9b591d2" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat/secrets/sb-primary-connection-string" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "114962ec6ca146f08cd8a3cde9b591d2" -> (known after apply)
      ~ versionless_id          = "https://ccpay-aat.vault.azure.net/secrets/sb-primary-connection-string" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat"
        name     = "ccpay-aat"
      ~ tags     = {
          ~ "Team Contact"           = "#cc-payments-tech " -> "#fee-pay-nightly-pipeline"
            # (9 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ccpay-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ccpay-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat|ccpay-aat"
        name                       = "ccpay-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.feepay-fail-action-group.azurerm_resource_group_template_deployment.action-group will be created
  + resource "azurerm_resource_group_template_deployment" "action-group" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "feepay_alert"
      + output_content      = (known after apply)
      + parameters_content  = (sensitive value)
      + resource_group_name = "ccpay-aat"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName      = {
                      + type = "string"
                    }
                  + emailReceiverAddress = {
                      + metadata = {
                          + description = "Email address of the receiver"
                        }
                      + type     = "string"
                    }
                  + emailReceiverName    = {
                      + metadata = {
                          + description = "Name of the email receiver"
                        }
                      + type     = "string"
                    }
                  + location             = {
                      + defaultValue = "global"
                      + type         = "string"
                    }
                  + shortName            = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-04-01"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('actionGroupName')]"
                      + properties = {
                          + emailReceivers   = [
                              + {
                                  + emailAddress = "[parameters('emailReceiverAddress')]"
                                  + name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          + enabled          = true
                          + groupShortName   = "[parameters('shortName')]"
                          + smsReceivers     = []
                          + webhookReceivers = []
                        }
                      + tags       = {}
                      + type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        )
    }

  # module.feepay-fail-action-group.azurerm_template_deployment.action-group will be destroyed
  # (because azurerm_template_deployment.action-group is not in configuration)
  - resource "azurerm_template_deployment" "action-group" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Resources/deployments/feepay_alert_aat" -> null
      - name                = "feepay_alert_aat" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"      = "feepay Fail  Alert - aat"
          - "emailReceiverAddress" = (sensitive value)
          - "emailReceiverName"    = "feepay Alerts"
          - "location"             = "global"
          - "shortName"            = "feepay_alert"
        } -> null
      - resource_group_name = "ccpay-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName      = {
                      - type = "string"
                    }
                  - emailReceiverAddress = {
                      - metadata = {
                          - description = "Email address of the receiver"
                        }
                      - type     = "string"
                    }
                  - emailReceiverName    = {
                      - metadata = {
                          - description = "Name of the email receiver"
                        }
                      - type     = "string"
                    }
                  - location             = {
                      - defaultValue = "global"
                      - type         = "string"
                    }
                  - shortName            = {
                      - type = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-04-01"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('actionGroupName')]"
                      - properties = {
                          - emailReceivers   = [
                              - {
                                  - emailAddress = "[parameters('emailReceiverAddress')]"
                                  - name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          - enabled          = true
                          - groupShortName   = "[parameters('shortName')]"
                          - smsReceivers     = []
                          - webhookReceivers = []
                        }
                      - tags       = {}
                      - type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        ) -> null
    }

  # module.feepay-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be created
  + resource "azurerm_resource_group_template_deployment" "custom_alert" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "feepay-fail-alert"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + actionGroupName          = {
                  + value = "feepay Fail  Alert - aat"
                }
              + actionGroupRg            = {
                  + value = "ccpay-aat"
                }
              + alertDesc                = {
                  + value = "Triggers when an feepay exception is received."
                }
              + alertName                = {
                  + value = "feepay-fail-alert"
                }
              + appInsightsName          = {
                  + value = "ccpay-aat"
                }
              + appInsightsQuery         = {
                  + value = "requests | where toint(resultCode) >= 500 | sort by timestamp desc"
                }
              + commonTags               = {
                  + value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY2NwYXlmci1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYXBwbGljYXRpb24iOiJmZWVzLWFuZC1wYXltZW50cyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY2MtcGF5bWVudHMiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJGZWVzL1BheSJ9"
                }
              + customEmailSubject       = {
                  + value = "Alert for 5xx Error - aat "
                }
              + frequencyInMinutes       = {
                  + value = 15
                }
              + location                 = {
                  + value = "uksouth"
                }
              + severityLevel            = {
                  + value = "3"
                }
              + timeWindowInMinutes      = {
                  + value = 15
                }
              + triggerThreshold         = {
                  + value = 20
                }
              + triggerThresholdOperator = {
                  + value = "GreaterThan"
                }
            }
        )
      + resource_group_name = "ccpay-aat"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction   = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity     = "[parameters('severityLevel')]"
                              + status       = "Active"
                              + trigger      = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.feepay-fail-alert.azurerm_template_deployment.custom_alert[0] will be destroyed
  # (because azurerm_template_deployment.custom_alert is not in configuration)
  - resource "azurerm_template_deployment" "custom_alert" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Resources/deployments/feepay-fail-alert" -> null
      - name                = "feepay-fail-alert" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"          = "feepay Fail  Alert - aat"
          - "actionGroupRg"            = "ccpay-aat"
          - "alertDesc"                = "Triggers when an feepay exception is received."
          - "alertName"                = "feepay-fail-alert"
          - "appInsightsName"          = "ccpay-aat"
          - "appInsightsQuery"         = "requests | where toint(resultCode) >= 500 | sort by timestamp desc"
          - "commonTags"               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY2NwYXlmci1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYXBwbGljYXRpb24iOiJmZWVzLWFuZC1wYXltZW50cyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY2MtcGF5bWVudHMiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJGZWVzL1BheSJ9"
          - "customEmailSubject"       = "Alert for 5xx Error - aat "
          - "frequencyInMinutes"       = "15"
          - "location"                 = "uksouth"
          - "severityLevel"            = "3"
          - "timeWindowInMinutes"      = "15"
          - "triggerThreshold"         = "20"
          - "triggerThresholdOperator" = "GreaterThan"
        } -> null
      - resource_group_name = "ccpay-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName          = {
                      - type = "string"
                    }
                  - actionGroupRg            = {
                      - type = "string"
                    }
                  - alertDesc                = {
                      - type = "string"
                    }
                  - alertName                = {
                      - type = "string"
                    }
                  - appInsightsName          = {
                      - type = "string"
                    }
                  - appInsightsQuery         = {
                      - type = "string"
                    }
                  - commonTags               = {
                      - type = "string"
                    }
                  - customEmailSubject       = {
                      - type = "string"
                    }
                  - frequencyInMinutes       = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - location                 = {
                      - type = "string"
                    }
                  - severityLevel            = {
                      - defaultValue = "3"
                      - type         = "string"
                    }
                  - timeWindowInMinutes      = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - triggerThreshold         = {
                      - type = "string"
                    }
                  - triggerThresholdOperator = {
                      - allowedValues = [
                          - "GreaterThan",
                          - "Equal",
                          - "LessThan",
                        ]
                      - defaultValue  = "GreaterThan"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-09-01-preview"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('alertName')]"
                      - properties = {
                          - action      = {
                              - aznsAction   = {
                                  - actionGroup  = [
                                      - "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  - emailSubject = "[parameters('customEmailSubject')]"
                                }
                              - "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              - severity     = "[parameters('severityLevel')]"
                              - status       = "Active"
                              - trigger      = {
                                  - consecutiveBreach = 1
                                  - threshold         = "[parameters('triggerThreshold')]"
                                  - thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          - description = "[parameters('alertDesc')]"
                          - enabled     = "true"
                          - schedule    = {
                              - frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              - timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          - skuType     = "L1"
                          - source      = {
                              - dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              - query        = "[parameters('appInsightsQuery')]"
                              - queryType    = "ResultCount"
                            }
                        }
                      - tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - additionalTags = {
                      - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  - tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.feesregister-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.feesregister-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat|fees-register-aat"
        name                       = "fees-register-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.ServiceBus/namespaces/ccpay-servicebus-aat"
        name                                = "ccpay-servicebus-aat"
      ~ tags                                = {
          ~ "Team Contact"           = "#cc-payments-tech " -> "#fee-pay-nightly-pipeline"
            # (9 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 7 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":86,"Program":"tfcmt","SHA1":"","Vars":{}} -->